//IBMUSER$ JOB  MSGCLASS=H,NOTIFY=&SYSUID
//*------- Substitute client's WS IP address on ISPSTART command, then
//*        submit ISPF C/S starting job. Please note: this job must be
//*        submitted via FTP from the workstation.
//WSIP     EXEC PGM=IKJEFT1B,PARM='WSIP'
//SYSEXEC  DD  DISP=SHR,DSN=CPAC.CMDPROC
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  DUMMY
//OUTPUT   DD  SYSOUT=(B,INTRDR)
//INPUT    DD  DATA
//ISPFCS   JOB  MSGCLASS=H,NOTIFY=&SYSUID
//*------- Copy user's ISPF profile to allow 3270 ISPF session
//COPY     EXEC PGM=IEBCOPY
//SYSPRINT DD  DUMMY
//SYSIN    DD  DUMMY
//SYSUT1   DD  DISP=SHR,DSN=&SYSUID..ISPF.ISPPROF
//SYSUT2   DD  DISP=(NEW,PASS),DSN=&&PROF,
//             UNIT=VIO,SPACE=(TRK,(1,1,20)),
//             DCB=(LRECL=80,BLKSIZE=0,RECFM=FB)
//*------- Invoke ISPF C/S
//ISPF     EXEC PGM=IKJEFT01,DYNAMNBR=40
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  *
 ISPSTART GUI(IP:&WSAIP.:15993,GUIDSP) +
        PANEL(ISR@PRIM) NEWAPPL(ISR) +
        TITLE(HOMEZ - &USERID.) +
        CODEPAGE(0037) CHARSET(0697)
//SYSPROC  DD  DISP=SHR,DSN=CPAC.CMDPROC           CPAC, LOCAL
//         DD  DISP=SHR,DSN=SYS1.SBLSCLI0          IPCS
//         DD  DISP=SHR,DSN=GIM.SGIMCLS0           SMP/E
//         DD  DISP=SHR,DSN=CBC.SCCNUTL            C/C++
//         DD  DISP=SHR,DSN=ICQ.ICQCCLIB           TSO/E
//         DD  DISP=SHR,DSN=SYS1.SBLSCLI0          BLS
//         DD  DISP=SHR,DSN=FFST.V120ESA.SEPWCENU  FFST
//         DD  DISP=SHR,DSN=SYS1.HRFCLST           RACF
//         DD  DISP=SHR,DSN=ISP.SISPCLIB           ISPF
//         DD  DISP=SHR,DSN=GDDM.SADMSAM           GDDM
//         DD  DISP=SHR,DSN=SYS1.DGTCLIB           DFSMS
//SYSEXEC  DD  DISP=SHR,DSN=FFST.V120ESA.SEPWSRC1  FFST
//         DD  DISP=SHR,DSN=EUVF.SEUVFEXC          NAS
//         DD  DISP=SHR,DSN=ISF.SISFEXEC           SDSF
//         DD  DISP=SHR,DSN=TCPIP.SEZAEXEC         TCP/IP
//         DD  DISP=SHR,DSN=ISP.SISPEXEC           ISPF
//         DD  DISP=SHR,DSN=SYS1.SBPXEXEC          OMVS
//         DD  DISP=SHR,DSN=IOE.SIOEEXEC           RFS
//         DD  DISP=SHR,DSN=AOP.SAOPEXEC           AOP
//         DD  DISP=SHR,DSN=GLD.SGLDEXEC           LDAP
//         DD  DISP=SHR,DSN=SYS1.SEDGEXE1          DFSMS
//SYSHELP  DD  DSN=SYS1.HELP,DISP=SHR              MVS
//         DD  DSN=SYS1.HELPENP,DISP=SHR           TSO/E
//         DD  DSN=ISF.SISFHELP,DISP=SHR           SDSF
//         DD  DSN=SYS1.SBDTHELP,DISP=SHR          BDT
//         DD  DSN=ISP.SISPHELP,DISP=SHR           ISPF
//ISPLLIB  DD  DISP=SHR,DSN=SYS1.DFQLLIB           DFSMS
//         DD  DISP=SHR,DSN=SYS1.DGTLLIB           DFSMS
//ISPPLIB  DD  DISP=SHR,DSN=CPAC.ISPPLIB           CPAC, LOCAL
//         DD  DISP=SHR,DSN=ISP.SISPPENU           ISPF
//         DD  DISP=SHR,DSN=SYS1.SHASPNL0          JES2
//         DD  DISP=SHR,DSN=SYS1.SBLSPNL0          IPCS
//         DD  DISP=SHR,DSN=GIM.SGIMPENU           SMP/E
//         DD  DISP=SHR,DSN=ICQ.ICQPLIB            TSO/E
//         DD  DISP=SHR,DSN=SYS1.SCBDPENU          HCD
//         DD  DISP=SHR,DSN=FFST.V120ESA.SEPWPENU  FFST
//         DD  DISP=SHR,DSN=ISF.SISFPLIB           SDSF
//         DD  DISP=SHR,DSN=TCPIP.SEZAPENU         TCPIP
//         DD  DISP=SHR,DSN=SYS1.HRFPANL           RACF
//         DD  DISP=SHR,DSN=GDDM.SADMPNL           GDDM
//         DD  DISP=SHR,DSN=SYS1.SBDTPNL0          BDT
//         DD  DISP=SHR,DSN=SYS1.SBPXPENU          OMVS
//         DD  DISP=SHR,DSN=AOP.SAOPPENU           AOP
//         DD  DISP=SHR,DSN=SYS1.DFQPLIB           DFSMS
//         DD  DISP=SHR,DSN=SYS1.DGTPLIB           DFSMS
//         DD  DISP=SHR,DSN=SYS1.SEDGPENU          DFRMM
//ISPSLIB  DD  DISP=SHR,DSN=GIM.SGIMSENU           SMP/E
//         DD  DISP=SHR,DSN=ICQ.ICQSLIB            TSO/E
//         DD  DISP=SHR,DSN=CSF.SCSFSKL0           ICSF
//         DD  DISP=SHR,DSN=ISF.SISFSLIB           SDSF
//         DD  DISP=SHR,DSN=SYS1.HRFSKEL           RACF
//         DD  DISP=SHR,DSN=ISP.SISPSENU           ISPF
//         DD  DISP=SHR,DSN=ISP.SISPSLIB           ISPF
//         DD  DISP=SHR,DSN=SYS1.SBLSKEL0          IPCS
//         DD  DISP=SHR,DSN=SYS1.DGTSLIB           DFSMS
//ISPMLIB  DD  DISP=SHR,DSN=GIM.SGIMMENU           SMP/E
//         DD  DISP=SHR,DSN=ICQ.ICQMLIB            TSO/E
//         DD  DISP=SHR,DSN=SYS1.SCBDMENU          HCD
//         DD  DISP=SHR,DSN=CSF.SCSFMSG0           ICSF
//         DD  DISP=SHR,DSN=SYS1.SERBMENU          RMF
//         DD  DISP=SHR,DSN=ISF.SISFMLIB           SDSF
//         DD  DISP=SHR,DSN=TCPIP.SEZAMENU         TCPIP
//         DD  DISP=SHR,DSN=SYS1.HRFMSG            RACF
//         DD  DISP=SHR,DSN=ISP.SISPMENU           ISPF
//         DD  DISP=SHR,DSN=GDDM.SADMMSG           GDDM
//         DD  DISP=SHR,DSN=SYS1.SBDTMSG           BDT
//         DD  DISP=SHR,DSN=SYS1.SBLSMSG0          IPCS
//         DD  DISP=SHR,DSN=SYS1.SBPXMENU          OMVS
//         DD  DISP=SHR,DSN=AOP.SAOPMENU           AOP
//         DD  DISP=SHR,DSN=SYS1.DGTMLIB           DFSMS
//         DD  DISP=SHR,DSN=SYS1.DFQMLIB           DFSMS
//         DD  DISP=SHR,DSN=SYS1.SEDGMENU          DFSMS
//ISPILIB  DD  DISP=SHR,DSN=ISP.SISPSAMP           ISPF CS
//ISPTLIB  DD  DISP=SHR,DSN=IBMUSER.ISPF.ISPPROF   PRIVATE
//         DD  DISP=SHR,DSN=GIM.SGIMTENU           SMP/E
//         DD  DISP=SHR,DSN=ICQ.ICQTABLS           TSO/E
//         DD  DISP=SHR,DSN=SYS1.SCBDTENU          HCD
//         DD  DISP=SHR,DSN=CSF.SCSFTLIB           ICSF
//         DD  DISP=SHR,DSN=SYS1.SERBT             RMF
//         DD  DISP=SHR,DSN=SYS1.SERBTENU          RMF
//         DD  DISP=SHR,DSN=ISF.SISFTLIB           SDSF
//         DD  DISP=SHR,DSN=ISP.SISPTENU           ISPF
//         DD  DISP=SHR,DSN=SYS1.SBLSTBL0          IPCS
//         DD  DISP=SHR,DSN=SYS1.SBPXTENU          OMVS
//         DD  DISP=SHR,DSN=SYS1.DGTTLIB           DFSMS
//ISPPROF  DD  DSN=&&PROF,DISP=(OLD,PASS)          TEMPORARY COPY
//ISPCTL0  DD  DISP=(NEW,DELETE),SPACE=(TRK,(10,10)),UNIT=VIO,
//             DCB=(LRECL=80,BLKSIZE=0,DSORG=PS,RECFM=FB)
//ISPCTL1  DD  DISP=(NEW,DELETE),SPACE=(TRK,(10,10)),UNIT=VIO,
//             DCB=(LRECL=80,BLKSIZE=0,DSORG=PS,RECFM=FB)
//ISPWRK1  DD  DISP=(NEW,DELETE),SPACE=(TRK,(10,10)),UNIT=VIO,
//             DCB=(LRECL=80,BLKSIZE=0,DSORG=PS,RECFM=FB)
//ISPLST1  DD  DISP=(NEW,DELETE),SPACE=(TRK,(10,10)),UNIT=VIO,
//             DCB=(LRECL=133,BLKSIZE=0,DSORG=PS,RECFM=VB)
//ISPLOG   DD  SYSOUT=*,
//             DCB=(LRECL=120,BLKSIZE=2400,DSORG=PS,RECFM=FB)
//ISPLIST  DD  SYSOUT=*,DCB=(LRECL=121,BLKSIZE=1210,RECFM=FBA)
//
